src/cf/src/Documents/ПлатёжнаяВедомостьНаАванс/ПлатёжнаяВедомостьНаАванс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПлатёжнаяВедомостьНаАванс</name>
  <registerRecords>AccumulationRegister.Зарплата</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧСотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/ПлатёжнаяВедомостьНаАванс/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Перечисляет печатные формы объекта.
// См. ПечатныеФормы.НоваяКоллекцияКомандПечати
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - пополняемая коллекция команд печати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	Команда = КомандыПечати.Добавить();
	Команда.ИмяМакета = "ПлатёжнаяВедомостьНаАванс";
	Команда.Представление = НСтр("ru = 'Платёжная ведомость на аванс'; fr = 'Paiement anticipé';
		|en = 'Advance payment'; es = 'Pago anticipado'");

КонецПроцедуры

// Формирует запрошенные печатные формы.
// См. ПечатныеФормы.СформироватьПечатныеФормы
//
// Параметры:
//  МассивОбъектов        - Массив          - печатаемые объекты
//  ПараметрыПечати       - Структура       - параметры команды печати
//  КоллекцияПечатныхФорм - ТаблицаЗначений - заполняемая коллекция печатных форм
//  ОбъектыПечати         - СписокЗначений  - соответствие объектов областям печати
//  ПараметрыВывода       - Структура       - параметры окна печати
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если ПечатныеФормы.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПлатёжнаяВедомостьНаАванс") Тогда
		Таб = Новый ТабличныйДокумент;
		Для Каждого Док Из МассивОбъектов Цикл
			НомерСтрокиНачало = Таб.ВысотаТаблицы + 1;
			ПечатьПлатёжнаяВедомостьНаАванс(Док, Таб);
			ПечатныеФормы.ЗадатьОбластьПечати(Таб, НомерСтрокиНачало, ОбъектыПечати, Док);
		КонецЦикла;
		ПечатныеФормы.ВывестиТабличныйДокумент(КоллекцияПечатныхФорм, "ПлатёжнаяВедомостьНаАванс",
			НСтр("ru = 'Платёжная ведомость на аванс'; fr = 'Paiement anticipé';
			|en = 'Advance payment'; es = 'Pago anticipado'"),
			Таб, "Документ.ПлатёжнаяВедомостьНаАванс.ПлатёжнаяВедомостьНаАванс");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

Процедура ПечатьПлатёжнаяВедомостьНаАванс(Док, Таб) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Таб.ОтображатьСетку = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Таб.АвтоМасштаб = Истина;
	Таб.КлючПараметровПечати = "Параметры_печати_Документ_ПлатёжнаяВедомостьНаАванс_ПлатёжнаяВедомостьНаАванс";	
	Макет = ПечатныеФормы.МакетПечатнойФормы("Документ.ПлатёжнаяВедомостьНаАванс.ПлатёжнаяВедомостьНаАванс");
	оШапка = Макет.ПолучитьОбласть("Шапка");
	оШапка.Параметры.Номер = Док.Номер;
	оШапка.Параметры.Дата = Формат(Док.Дата, "ДФ=dd.MM.yyyy");
	оШапка.Параметры.ПериодДокумента = Формат(Док.Дата, "ДФ='ММММ гггг'");
    Таб.Вывести(оШапка);
	оСтрока = Макет.ПолучитьОбласть("Строка");
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПлатёжнаяВедомостьНаАвансТЧСотрудники.Ссылка КАК Док,
	                      |	ПлатёжнаяВедомостьНаАвансТЧСотрудники.НомерСтроки КАК НомерСтроки,
	                      |	ПлатёжнаяВедомостьНаАвансТЧСотрудники.Сотрудник КАК Сотрудник,
	                      |	ПлатёжнаяВедомостьНаАвансТЧСотрудники.Сумма КАК Сумма
	                      |ИЗ
	                      |	Документ.ПлатёжнаяВедомостьНаАванс.ТЧСотрудники КАК ПлатёжнаяВедомостьНаАвансТЧСотрудники
	                      |ГДЕ
	                      |	ПлатёжнаяВедомостьНаАвансТЧСотрудники.Ссылка = &Док
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	НомерСтроки");
	Запрос.Параметры.Вставить("Док", Док);
	Выб = Запрос.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		оСтрока.Параметры.Заполнить(Выб);
		Таб.Вывести(оСтрока);
	КонецЦикла;
	оПодвал = Макет.ПолучитьОбласть("Подвал");
	оПодвал.Параметры.Итого = Док.ТЧСотрудники.Итог("Сумма");
	оПодвал.Параметры.Комментарий = Док.Комментарий;
	Таб.Вывести(оПодвал);
	Таб.ВывестиГоризонтальныйРазделительСтраниц();
КонецПроцедуры
